'''
Напишите программу, которая считывает длины двух 
катетов в прямоугольном треугольнике и выводит его площадь.
'''


x = float(input())
y = float(input())
s = 1/2*x*y
print(s)
