'''
Две старушки идут навстречу друг другу с постоянными скоростями V1 и V2 км/ч. 
Определите, через какое время старушки встретятся, если расстояние между ними равно S км.
'''

a = float(input())
b = float(input())
c = float(input())
speed = b+c
time = a/speed
print(time)

