'''
У известного американского писателя Рэя Бредбери есть роман «451 градус по Фаренгейту». Напишите программу, которая определяет, 
какой температуре по шкале Цельсия соответствует указанное значение по шкале Фаренгейта.
'''

x = float(input())
y = (5/9)*(x-32)
print(y)

