'''
Дано положительное действительное число. Выведите его дробную часть.
'''

x = float(input())
y = x - int(x)
print(y)

