'''
Напишите программу, которая находит наименьшее и наибольшее из пяти чисел.
'''

a = int(input())
b = int(input())
c = int(input())
d = int(input())
e = int(input())
l = [a, b, c, d, e]
print('Наименьшее число =', min(l))
print('Наибольшее число =', max(l))

