'''
Даны пять чисел. Напишите программу, которая вычисляет сумму их модулей
'''

a = float(input())
b = float(input())
c = float(input())
d = float(input())
e = float(input())
z = abs(a)+abs(b)+abs(c)+abs(d)+abs(e)
print(z)

