'''
Напишите программу определяющую манхэттенское расстояние между двумя точками, координаты которых заданы.
'''

a = int(input())
b = int(input())
a2 = int(input())
b2 = int(input())
z = abs(a-a2)+ abs(b-b2)
print(z)

