'''
Напишите программу определяющую площадь круга и длину окружности по заданному радиусу
'''

from math import *

x = float(input())
r = pi*x**2
c = 2 * pi*x
print(r)
print(c)

