'''
Дано предложение и количество раз которое его надо повторить. 
Напишите программу, которая повторяет данное предложение нужное количество раз.
'''

x = input()
y = int(input())
for i in range(0, y):
    print(x)

    