'''
Напишите программу, которая использует ровно три цикла for для печати следующей последовательности символов:
'''

a = 'AAA'
b = 'BBBB'
t = 'TTTTT'
for i in range(0, 6):
    print(a)
for i in range(0, 5):
    print(b)
print('E')
for i in range(0, 9):
    print(t)
print('G')

