'''
На вход программе подается натуральное число n.
Напишите программу, которая печатает звездный прямоугольник размерами n*19
'''

x = int(input())
n = '*******************'

for i in range(0, x):
    print(n)

    