'''
Напишите программу, которая выводит звездный треугольник в соответствии с примером.
'''

x = int(input())
for i in range(x, 0, -1):
    print('*'*i)

    