'''
Напишите функцию print_digit_sum(), которая принимает одно целое число num и выводит на печать сумму его цифр.
'''

def print_digit_sum(num):
    l =[int(i) for i in str(n)]
    print(sum(l))

# считываем данные
n = int(input())

# вызываем функцию
print_digit_sum(n)

